; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	satellite5 - satellite
	instrument7 - instrument
	infrared4 - mode
	spectrograph0 - mode
	image3 - mode
	spectrograph5 - mode
	spectrograph1 - mode
	infrared2 - mode
	spectrograph6 - mode
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star1 - direction
	Planet5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 image3)
	(supports instrument0 spectrograph6)
	(calibration_target instrument0 Star2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument1 spectrograph0)
	(supports instrument1 spectrograph5)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph6)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star1)
	(supports instrument3 spectrograph6)
	(supports instrument3 infrared4)
	(supports instrument3 spectrograph5)
	(calibration_target instrument3 GroundStation3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet5)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star2)
	(supports instrument5 spectrograph5)
	(calibration_target instrument5 Star4)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star2)
	(supports instrument6 spectrograph6)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet8)
	(supports instrument7 spectrograph0)
	(supports instrument7 image3)
	(supports instrument7 infrared4)
	(calibration_target instrument7 Star1)
	(on_board instrument7 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star1)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite2 GroundStation0)
	(have_image Planet5 infrared2)
	(have_image Phenomenon6 spectrograph6)
	(have_image Phenomenon6 spectrograph5)
	(have_image Star7 infrared2)
	(have_image Star7 spectrograph0)
	(have_image Planet8 infrared4)
	(have_image Phenomenon9 infrared4)
	(have_image Phenomenon9 spectrograph5)
))

)

; plan
1. (turn_to satellite1 groundstation3 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 groundstation3)
   goals met: 0 of 10
2. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 10
3. (calibrate satellite1 instrument3 groundstation3)
   added: (calibrated instrument3)
   goals met: 0 of 10
4. (turn_to satellite1 phenomenon9 groundstation3)
   deleted: (pointing satellite1 groundstation3)
   added: (pointing satellite1 phenomenon9)
   goals met: 0 of 10
5. (take_image satellite1 phenomenon9 instrument3 spectrograph5)
   added: (have_image phenomenon9 spectrograph5)
   goals met: 1 of 10
6. (take_image satellite1 phenomenon9 instrument3 infrared4)
   added: (have_image phenomenon9 infrared4)
   goals met: 2 of 10
7. (turn_to satellite1 phenomenon6 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon6)
   goals met: 2 of 10
8. (take_image satellite1 phenomenon6 instrument3 spectrograph6)
   added: (have_image phenomenon6 spectrograph6)
   goals met: 3 of 10
9. (take_image satellite1 phenomenon6 instrument3 spectrograph5)
   added: (have_image phenomenon6 spectrograph5)
   goals met: 4 of 10
10. (turn_to satellite1 star1 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 star1)
   goals met: 4 of 10
11. (switch_off instrument3 satellite1)
   deleted: (power_on instrument3)
   added: (power_avail satellite1)
   goals met: 4 of 10
12. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 4 of 10
13. (calibrate satellite1 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 4 of 10
14. (switch_on instrument7 satellite5)
   deleted: (power_avail satellite5)
   added: (power_on instrument7)
   goals met: 4 of 10
15. (calibrate satellite5 instrument7 star1)
   added: (calibrated instrument7)
   goals met: 4 of 10
16. (turn_to satellite0 groundstation0 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 groundstation0)
   goals met: 5 of 10
17. (turn_to satellite1 planet5 star1)
   deleted: (pointing satellite1 star1)
   added: (pointing satellite1 planet5)
   goals met: 5 of 10
18. (take_image satellite1 planet5 instrument2 infrared2)
   added: (have_image planet5 infrared2)
   goals met: 6 of 10
19. (turn_to satellite1 star7 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star7)
   goals met: 6 of 10
20. (take_image satellite1 star7 instrument2 infrared2)
   added: (have_image star7 infrared2)
   goals met: 7 of 10
21. (turn_to satellite2 groundstation0 star2)
   deleted: (pointing satellite2 star2)
   added: (pointing satellite2 groundstation0)
   goals met: 8 of 10
22. (turn_to satellite5 planet8 star1)
   deleted: (pointing satellite5 star1)
   added: (pointing satellite5 planet8)
   goals met: 8 of 10
23. (take_image satellite5 planet8 instrument7 infrared4)
   added: (have_image planet8 infrared4)
   goals met: 9 of 10
24. (turn_to satellite5 star7 planet8)
   deleted: (pointing satellite5 planet8)
   added: (pointing satellite5 star7)
   goals met: 9 of 10
25. (take_image satellite5 star7 instrument7 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 10 of 10
